import Chtml
import deal
import deal2
import pyperclip
import meiju
from Class import Program
program=Program()
print('''
                                               LL             A
                                               LL            A A
                                               LL           AA AA
                                               LL          AA   AA
                                               LL          AAAAAAA
                                               LL         AA     AA
                                               LL         AA     AA
                                               LLLLLLLLL  AA     AA
                                               LLLLLLLLL  AA     AA
TTTTTTTTTT   OOOOOOO   UU     UU  RRRRRRR              EEEEEEEEE  IIIIIIIIII  FFFFFFFFF  FFFFFFFFF  EEEEEEEEE  LL
TTTTTTTT  OOOOOOOOO  UU     UU  RRRRRRRR             EEEEEEEEE  IIIIIIIIII  FFFFFFFFF  FFFFFFFFF  EEEEEEEEE  LL
  TT      OO     OO  UU     UU  RR     RR            EE             II      FF         FF         EE         LL
  TT      OO     OO  UU     UU  RR     RR            EE             II      FF         FF         EE         LL
  TT      OO     OO  UU     UU  RRRRRRRR             EEEEEEEE       II      FFFFFFFF   FFFFFFFF   EEEEEEEE   LL
  TT      OO     OO  UU     UU  RR  RR               EE             II      FF         FF         EE         LL
  TT      OO     OO  UU     UU  RR   RR              EE             II      FF         FF         EE         LL
  TT      OOOOOOOOO  UUUUUUUUU  RR    RR             EEEEEEEEE  IIIIIIIIII  FF         FF         EEEEEEEEE  LLLLLLLLL
  TT       OOOOOOO    UUUUUUU   RR     RR            EEEEEEEEE  IIIIIIIIII  FF         FF         EEEEEEEEE  LLLLLLLLL
                                                          .
                                                         1
                                                         1
                                                         1
                                                         M
                                                         M
                                                         M
                                                         M
                                                        \M/
                                                     . ' M ` .
                                                   \##-#####-##/
                                                    \# ##### #/
                                                  ###############
                                                  ###############
                                                   \ ! ! ! ! ! /
                                                    )! ! ! ! !(
                                                    +---------+
                                                    +! ! ! ! !+
                                                    +----*----+
                                                   +`. .':`. .'+
                                                   + .^. : .^. +
                                                   +:...:*:...:+
                                                   +`. .':`. .'+
                                                   + .^. : .^. +
                                                   +:...:*:...:+
                                                   +`. .':`. .'+
                                                   +. ^. : .^ .+
                                                  +:....:*:....:+
                                                  +` .  ':`  . '+
                                                  +  .^. : .^.  +
                                                  +:....:*:....:+
                                                  +` .. ':` .. '+
                                                  +. '` .:. '` .+
                                                  +:....:*:....:+
                                                  + `. .':`. .' +
                                                  +   X  :  X   +
                                                  +.'  `.:.'  `.+
                                                 +:......*......:+
                                                 +`.   .':`.   .'+
                                                 +   X   :   X   +
                                                 + .' `. : .' `. +
                                                 +.......*.......+
                                                 +` . . ':` . . '+
                                                 +   X   :   X   +
                                                 + '   ` : '   ` +
                                                 +../########....+
                                                 +`/#########\ .'+
                                                +  ############   +
                                                + '############`  +
                                                +:.......*.......:+
                                                + ` .  ' : `  . ' +
                                                +    X   :   X    +
                                                + .'   `.:.'   `. +
                                                +:.......*.......:+
                                                +`      ':`      '+
                                               +  `   '  :  `   '  +
                                               +    X   : :   X    +
                                               +:.......*.*.......:+
                                               +`      ': :`      '+
                                               + `   '  : :  `   ' +
                                               +   X   : X :   X   +
                                              +  '   ` :' `: '   `  +
                                              +:.......*...*.......:+
                                              +`      ':` ':`      '+
                                              + `   '  : X :  `   ' +
                                              +   X   :     :   X   +
                                              + '   ` :/   \: '   ` +
                                             +:.......*.....*.......:+
                                             +`      ':`   ':`      '+
                                             + `   '  : `.' :  `   ' +
                                            +    X   :  ' `  :   X    +
                                            +  '   ` :'     `: '   `  +
                                            +:.......*.......*.......:+
                                           + `      ':`     ':`      ' +
                                           +  ` . '  :  `.'  :  ` . '  +
                                          +    ' `  :   ' `   :  ' `    +
                                          +. '    ` : '     ` : '    ` .+
                                         +..........*.........*..........+
                                         +  ###########################  +
                                         +  ###########################  +
                                        +   ###########################   +
                                     #########################################
                                    ###########################################
                                     \   1   1   1   1   1   1   1   1   1   /
                                      )  1   1   1   1   1   1   1   1   1  (
                                      +-----:-----+-------------+-----:-----+
                                      +     :     +             +     :     +
                                     *------*-----*-------------*-----*------*
                                     +XXXXXXXXXXX+XXXXXXXXXXXXXXX+XXXXXXXXXXX+
                                     *-----*-----*---------------*-----*-----*
                                    + `.   :  . '+               +` .  :   .' +
                                    +    . : '   +               +   ` : .    +
                                   +    . *.    +                 +    .* .    +
                                   + . '  : `.  +                 +  .' :  ` . +
                                  *:......*....:*                 *:....*......:*
                                  + `.   :   . '+                 +` .   :   .' +
                                 +     `.:. '  +                   +  ` .:.'     +
                                 +   . '* `.   +                   +   .' *` .   +
                                + . '   :    `.+                   +.'    :   ` . +
                                *:.....*.......*                   *.......*.....:*
                               +  ` .. :  .. ' +                   + ` ..  : .. '  +
                               +     . *'     +                     +     `* .     +
                              +  .. ' :   ` . +                     + . '   : ` ..  +
                              *.:....*.......:*                     *:.......*....:.*
                             +   ` ..: . - '  +                     +  ` - . :.. '   +
                             +    .. * ..    +                       +    .. * ..    +
                        -------------------------------------------------------------------
                          1 +:       :      +:       :       :       :+      :       :+ 1
                          1+ :       :      +:       :       :       :+      :       : +1
                        ###################################################################
                         1   1   1   1   1   1   1   1   1   1   1   1   1   1   1   1   1
                         1   1   1   1   1   1   1   1   1   1   1   1   1   1   1   1   1
                         +---------------------------------------------------------------+
                        +! . ! . ! . ! . !+. ! . ! . ! . ! . ! . ! . ! .+! . ! . ! . ! . !+
                       +:!: :!: :!: :!: :!+ :!: :!: :!: :!: :!: :!: :!: +!: :!: :!: :!: :!:+
                       +.!.:.!.:.!.:.!.:.!+:.!.:.!.:.!.:.!.:.!.:.!.:.!.:+!.:.!.:.!.:.!.:.!.+
                      +XXXXXXXXXXXXXXXXXX+\     \  ..-#######-..  /     /+XXXXXXXXXXXXXXXXXX+
                     *-------------------* \    .-' \  1 1 1  / `-.    / *-------------------*
                     +  ` .    : ..  '  +   \.-' \   .-------.   / `-./   +  `  .. :    . '  +
                    +.......:.*:........+ .-' \  .-''         ``-.  / `-. +........:*.:.......+
                   +    .  '  : ` .    +\:  \  -'                 `-  /  :/+    . ' :  `  .    +
                   +..:.......:.....:..+/ \ .-'                     `-. / \+..:.....:.......:..+
                  +    ` .   :    .  ' + \.'                           `./ + `  .    :   . '    +
                 +.........:.*..:.....+  /                               \  +.....:..*.:.........+
                +     .  '  :   ` .   + /                                 \ +   . '   :  `  .     +
                +...:......:........:+ /                                   \ +:........:..........+
               +    `  .  :  .  '    +/                                     \+    `  .  :  .  '    +
              +...........*.........+                                         +.........*...........+
             +     .  '  :   `  .   +                                         +   .  '   :  `  .     +
            +...:.......:.........:+                                           +:.........:.......:...+
           +    `  .    :   .   '  +                                           +  `   .   :    .  '    +
          +..........:.*.:........+                                             +........:.*.:..........+
         +     .   '  :   `  .    +                                             +    .  '   :  `   .     +
        +...:.........:.........:+                                               +:.........:.........:...+
       +   `   .     :     .   ' +                                               + `   .     :     .   '   +
      +...........:.*..:........+                                                 +........:..*.:...........+
     +      .   '  :   `  .     +                                                 +     .  '   :  `   .      +
    +...:.........:..........:.+                                                   +.:..........:.........:...+
   +     `  .     :      .  ' +                                                     + `  .      :     .  '     +
  +            ` *  - '      +                                                       +      ` -  * '            +
 -----------------------------------------------------------------------------------------------------------------
''')
while True:
        try:
                print("#1 电影推荐")
                print("#2 美剧推荐")
                print("#3 搜索电影")
                print("#4 退出")
                num=input("请输入操作序号#：")
                if num=="1":
                        print("加载中...")
                        program.next()
                        while True:
                                print(" -----------------------------------------------------------------------------------------------------------------")
                                print("#1 上一页")
                                print("#2 下一页")
                                print("#3 电影详细")
                                print("#4 返回")
                                print(" -----------------------------------------------------------------------------------------------------------------")
                                code=input("😊请输入操作序号😊#：")
                                if code=="1":
                                        print("加载中...")
                                        program.back()
                                elif code=="2":
                                        print("加载中...")
                                        program.next()
                                elif code=="3":
                                        while True:
                                                try:
                                                        num=int(input("😀请输入电影序号😊#："))
                                                        print("加载中...")
                                                        htmlarr=program.html()
                                                        download=deal.choose(Chtml.getext(htmlarr[num-1]))
                                                        while True:
                                                                try:    
                                                                        print(" -----------------------------------------------------------------------------------------------------------------")
                                                                        print("#1.下载")
                                                                        print("#2.返回")
                                                                        print(" -----------------------------------------------------------------------------------------------------------------")
                                                                        num=input("😊请输入操作😀:")
                                                                        if num=="1":
                                                                                print("                 (●'◡'●)请打开迅雷！！！(●'◡'●)")
                                                                                pyperclip.copy(download)
                                                                                break
                                                                        if num=="2":
                                                                                break
                                                                except:
                                                                        continue
                                                        break
                                                except:
                                                        continue 
					
                                elif code=="4":
                                        program.pages=program.pages-1
                                        break
                elif num=="3":
                        while True:
                                try:    
                                        htmlarr=deal2.search(input("😀请输入电影名称:"))    
                                        num=int(input("😊请输入电影序号(输入0返回)#:"))
                                        if num==0:
                                                break
                                        print("加载中...")
                                        download=deal2.info(Chtml.getext(htmlarr[num-1]))
                                        while True:
                                                try:    
                                                        print(" -----------------------------------------------------------------------------------------------------------------")
                                                        print("#1.下载")
                                                        print("#2.返回")
                                                        print(" -----------------------------------------------------------------------------------------------------------------")
                                                        num=input("😀请输入操作序号:")
                                                        if num=="1":
                                                                pyperclip.copy(download)
                                                                print("                 (●'◡'●)请打开迅雷！！！(●'◡'●)")
                                                                break
                                                        if num=="2":
                                                                break
                                                except:
                                                        continue
                                        break
                                except:
                                        continue
                elif num=="2":
                        print("加载中...")
                        program.mnext()
                        while True:
                                print(" -----------------------------------------------------------------------------------------------------------------")
                                print("#1 上一页")
                                print("#2 下一页")
                                print("#3 电影详细")
                                print("#4 选择页数")
                                print("#5返回")
                                print(" -----------------------------------------------------------------------------------------------------------------")
                                code=input("😊请输入操作序号😊#：")
                                if code=="1":
                                        print("加载中...")
                                        program.mback()
                                elif code=="2":
                                        print("加载中...")
                                        program.mnext()
                                elif code=="3":
                                        while True:
                                                try:
                                                        num=int(input("😀请输入电影序号😊(0返回)#："))
                                                        if num==0:
                                                                break
                                                        print("加载中...")
                                                        html=meiju.getHtml(program.mpages)
                                                        download=meiju.downloadUrl(num, html)
                                                        while True:
                                                                try:    
                                                                        print(" -----------------------------------------------------------------------------------------------------------------")
                                                                        print("#1.下载")
                                                                        print("#2.返回")
                                                                        print(" -----------------------------------------------------------------------------------------------------------------")
                                                                        num=input("😊请输入操作😀:")
                                                                        if num=="1":
                                                                                num=int(input("😊请输入要下载的集数😀:"))
                                                                                print("                 (●'◡'●)请打开迅雷！！！(●'◡'●)")
                                                                                pyperclip.copy(download[num-1])
                                                                        if num=="2":
                                                                                break
                                                                except:
                                                                        continue
                                                        break
                                                except:
                                                        continue 
                                elif code=="4":
                                        while True:
                                                try:
                                                        page=int(input("请输入跳转的页数😊(0返回):"))
                                                        if page==0:
                                                                break
                                                        print("加载中...")
                                                        print("-----------------------------------------------------------------------------------------------------------------")
                                                        meiju.getName(page)
                                                        num=int(input("请输入资源的序号😊(0返回)#:"))
                                                        print("加载中...")
                                                        html=meiju.getHtml(page)
                                                        if num==0:
                                                                break
                                                        download=meiju.downloadUrl(num,html)
                                                        print(" -----------------------------------------------------------------------------------------------------------------")
                                                        print("#1.下载")
                                                        print("#2.返回")
                                                        print(" -----------------------------------------------------------------------------------------------------------------")
                                                        num=input("😊请输入操作😀:")
                                                        if num=="1":
                                                                try:
                                                                        while True:
                                                                                num=int(input("😊请输入要下载的集数😀(0返回):"))
                                                                                if num==0:
                                                                                        break
                                                                                print("                 (●'◡'●)请打开迅雷！！！(●'◡'●)")
                                                                                pyperclip.copy(download[num-1])
                                                                except:
                                                                        continue
                                                        if num=="2":
                                                                break
                                                except:
                                                        continue
                                elif code=="5":
                                        break
                elif num=="4":
                        break        
        except:
                print("\n请检查网络连接！\n")

			
		
			
			
		
		
	
